using Arblib

P(α) =
    1 - 3α^2 + α^4 - 111 / 49 * α^6 + 143 / 294 * α^8 - 7536933 / 11957764 * α^10 +
    4598172331 / 47460365316 * α^12 - 30028809212865451 / 520327364608478700 * α^14 +
    49750141858992227 / 12487856750603488800 * α^16

E(α) =
    6α^9 / (15 - 20α) * (
        1 +
        sqrt(3) * α +
        sqrt(2) * α^2 +
        sqrt(14) / 7 * α^3 +
        sqrt(258) / 42 * α^4 +
        sqrt(1_968_837) / 3458 * α^5 +
        sqrt(106_525_799) / 31_122 * α^6 +
        2sqrt(2_129_312_323_981_473) / 624_696_345 * α^7 +
        sqrt(183_643_119_755_214_454) / 4_997_570_760 * α^8
    ) + 9α^18 / (15 - 20α)^2

v_lower(α) = P(α) - E(α)
v_upper(α) = P(α) + E(α)

@show v_lower(0.57)
@show v_upper(0.61)

@info "Exact value at 0.57: -0.0075062963687677018260483994174531997471506845765423075736583194196090866..."
@info "Exact value at 0.61: 0.0618411597085865447984609872585911256684337775594975631645495334933034666..."

@show v_lower(BigFloat(0.57))
@show v_upper(BigFloat(0.61))

P_correct(α) =
    1 - 3α^2 + α^4 - 111 // 49 * α^6 + 143 // 294 * α^8 - 7536933 // 11957764 * α^10 +
    4598172331 // 47460365316 * α^12 - 30028809212865451 // 520327364608478700 * α^14 +
    49750141858992227 // 12487856750603488800 * α^16

E_correct(α) =
    6α^9 / (15 - 20α) * (
        1 +
        sqrt(oftype(α, 3)) * α +
        sqrt(oftype(α, 2)) * α^2  +
        sqrt(oftype(α, 14)) / 7 * α^3  +
        sqrt(oftype(α, 258)) / 42 * α^4  +
        sqrt(oftype(α, 1_968_837)) / 3458 * α^5  +
        sqrt(oftype(α, 106_525_799)) / 31_122 * α^6  +
        2sqrt(oftype(α, 2_129_312_323_981_473)) / 624_696_345 * α^7  +
        sqrt(oftype(α, 183_643_119_755_214_454)) / 4_997_570_760 * α^8
    ) + 9α^18 / (15 - 20α)^2

v_lower_correct(α) = P_correct(α) - E_correct(α)
v_upper_correct(α) = P_correct(α) + E_correct(α)

@show v_lower_correct(BigFloat(0.57))
@show v_upper_correct(BigFloat(0.61))

@show v_lower_correct(BigFloat("0.57"))
@show v_upper_correct(BigFloat("0.61"))

@show v_lower_correct(Arb("0.57"))
@show v_upper_correct(Arb("0.61"))

v_lower_correct(BigFloat("0.57")) - BigFloat("0.02857494349754851842380087961496259058289166470274019410736704418784480353")